Repository: Azhy-Slemany/open_ai_dalle2
Catalog: lib/l10n/app_*.arb
Languages: ku

# welcomeText
source: Welcome to DALLE-2 Image generation for mobile, in this application you can generate images with text inputs using DALLE-2 API. We have 3 functionalities in this application, one is for generating image from text, and the second is for editing an image with a given text input, and the final one is for generating variations of an image.
ku: بەخێڕبێیت بۆ داڵی ٢، لەم بەرنامەیەدا وێنەت بۆ دروست دەکرێت بە نوسینی داواکاری، وە ٣ جۆر کردار لەخۆ دەگرێت، یەکێکیان بۆ دروستکردنی وێنە لە داواکاری تێکستەوە، یەکێکیان بۆ دەسکاری کردنی وێنە بە بەکارهێنانی داواکاری تێکست، وە سێیەمیشیان بۆ دروستکردنی گۆڕانکاری لە وێنەیەکدا.

source: Dark Mode
ku: دۆخی تاریک

source: Language
ku: زمان

source: Kurdish
ku: کوردی

source: Start Generating
ku: دەستپێکردنی دروستکردن

source: Prompt
ku: داواکاری

source: Number of images to generate
ku: ژمارەی وێنەکان بۆ هەر داواکاریەک

source: Generate Images
ku: دروستکردنی وێنەکان

source: Save
ku: پاشەکەوتکردن

source: Home
ku: سەرەکی

source: Settings
ku: ڕێکخستنەکان

source: Choose Image
ku: وێنەیەک هەڵبژێرە

source: Choose Mask
ku: ماسکێک هەڵبژێرە

source: About
ku: دەربارە

# aboutText
source: This application is for testing purposes only, it is not intended for commercial use. The application is based on the DALLE-2 model, which is a model for image generation, it contains 3 functionalities of this model, one is for generating image from text, and the second is for editing an image with a given text input, and the final one is for generating variations of an image. You can use it freely but only for a limited number of times, and if you want to use it more than that, you can contact use the original website to get full functionalities of the model.
ku: ئەم بەرنامەیە تەنها بۆ مەبەستی تاقیکردنەوەیە، بۆ بەکارهێنانی بازرگانی نییە. بەرنامەکە لەسەر بنەمای مۆدێلی DALLE-2 دامەزراوە کە مۆدێلێکە بۆ دروستکردنی وێنە، ٣ کارایی ئەم مۆدێلە لەخۆدەگرێت، یەکێکیان بۆ دروستکردنی وێنە لە دەقەوە، دووەمیان بۆ دەستکاریکردنی وێنەیەک بە هاتنە ژوورەوەی دەقێکی دیاریکراو، و کۆتایان بۆ دروستکردنی گۆڕانکارییەکانی وێنەیەک. دەتوانیت بە ئازادی بەکاری بهێنیت بەڵام تەنها بۆ ژمارەیەکی سنوردار، وە ئەگەر دەتەوێت زیاتر لەوە بەکاری بهێنیت، دەتوانیت پەیوەندی بکەیت بە بەکارهێنانی ماڵپەڕی ئەسڵی بۆ بەدەستهێنانی کاراییەکانی تەواوی مۆدێلەکە.

source: Image Generator
ku: دروستکردنی وێنە

source: Image Editor
ku: دەستکاریکردنی وێنە

source: Variations Generator
ku: دروستکردنی گۆڕانکارییەکان

source: Prompt cannot be empty
ku: داواکاری نابێت بەتاڵ بێت

source: Please select an image
ku: تکایە وێنەیەک هەڵبژێرە

source: Prompt cannot be more than 1000 chars
ku: داواکاری نابێت لە ١٠٠٠ پیت زیاتر بێت

# imageGeneratorShortText
source: Generate images from text input, you can generate multiple images with a given text input.
ku: دروستکردنی وێنە لە داواکاری نوسینەکیەوە، تۆ ئەتوانی چەند وێنەیەک بۆ هەر داواکاریەک دروست بکەیت.

# imageEditorShortText
source: Edit an image with a given text input, you can edit an image with a given text input.
ku: دەستکاریکردنی وێنەیەک بە نوسینی داواکاریەک، تۆ ئەتوانی وێنەیەک بە نوسینی داواکاریەک دەستکاری بکەیت.

# variationsGeneratorShortText
source: Generate variations of an image, you can generate multiple variations of an image.
ku: دروستکردنی گۆڕانکارییەکانی وێنەیەک، تۆ ئەتوانی چەندین گۆڕانکاری بۆ وێنەکەت ببینی کە لەلایەن ئەم مۆدێلەوە دروست دەکرێن..

# billing_hard_limit_reached
source: One of the keys is no longer working, let's try to use another key.
ku: یەکێک لە کلیلەکان کار ناکات، با کلیلێکی تر تاقی بکەینەوە...

# rate_limit_exceeded
source: Please use a smaller number of images to generate.
ku: تکایە ژمارەیەکی بچوکتر لە وێنە هەڵبژێرە

# engine_is_overloaded
source: The engine is overloaded, please try again later.
ku: خزمەتگوزاریەکە لۆدێکی زۆری لەسەرە، تکایە دواتر هەوڵبدەرەوە

# incorrect_api_key
source: Current key is invalid, let's try to use another key.
ku: یەکێک لە کلیلەکان هەڵەیە، با کلیلێکی تر تاقی بکەینەوە...

# unknown_error
source: Unknown error occured, please try again later.
ku: هەڵەیەکی نەزانراو ڕوویدا، تکایە دواتر هەوڵبدەرەوە
